yossif58/GW_WP_RAM4M3/gw_ra4m3/src/gsm.c
/* Includes ------------------------------------------------------------------*/
#include "hal_data.h"
#include <stdio.h>
#include <string.h>
#include "main.h"
#include <stdbool.h>
//#include "DLTprotocol.h"
//#include "FLASH_Program.h"
#include "hal_data.h"
#include "utils.h"
#include "flash_hp_ep.h"
#include "uart_LTE.h"
#include "LongiWrapper.h"
#pragma pack(1)
//#define DEBUG_UART_MODE1
//	Modem handler states mechine
//===========================================
#ifdef LONGI_GW
extern  uint32_t SendLogin2Server(void );
extern  uint32_t SendHeartBit2Server(void );
#else
extern uint32_t PP_ExtractDlt(uint8_t *pMsgIn);
extern void PP_ReqConnectionFromServer(void);
#endif
extern bool write_internal_config_flag;
extern bool write_internal_logger_flag;
extern bool ToggleLedsReq;
//extern bool MagnetDetect;
extern bool powerup_start;

uint8_t GsmCompleateStatus(void);
void SetGsmCompleate(void);
void ClrGsmCompleate(void);
//void SMS_Handler(void);
uint8_t ConnectRetries=5;
static heartbit_count =0;
enum Connectiobn_State {
  MODEM_DISCONNECT_STATE = 0,   // Init State Communication not established with modem
  MODEM_AT0_STATE,
  MODEM_SET_CONFIGURATION_STATE, // communication estalished with modem
  MODEM_SET_SMS_CONFIGURATION_STATE,
  SIM_READY_STATE,
  MODEM_PROVIDER_STATE,
  MODEM_MAGNET_READ_SMS,
  MODEM_ACTIVATE_CONTEXID_STATE,
  MODEM_ACTIVATE_SET_CONTEXID_STATE,
  MODEM_QIOPEN_STATE,
  MODEM_CONNECT_STATE,          
  MODEM_DATA_STATE
 // SIM_EXIST_STATE,           // sim exist in modem 
 // PROVIDER_CONNECT_STATE,    // established connection with the GSM provider 
 // SERVER_CONNECT_STATE       // Tcp connection with server established
};
enum Response_State {
  NO_RESPONSE = 0,
  WRONG_RESPONSE ,
  GOOD_RESPONSE
};

#define SEND_RETRY_TIMES        10
extern uint32_t GsmTimer;
uint16_t SendRetry = SEND_RETRY_TIMES;
#ifdef DEBUG_UART_MODE3
void PrintSMSError (char *data);
#endif
//uint8_t tmpbufout[100]; // y.f. temp to be removed
void sendfreesms(uint8_t * pDdataIn);
uint16_t  ReadConfigFromSMS(uint8_t *pDdataIn, uint16_t Len);
void ReadSmsMsg(void);
void  Error_UartGSMHandler(void);
void RingHandler(void);
void SendSMSGPRS(void);
void DelSmsMsg(void);
void SendATD(void);
void SendDQIACT_SET2Modem(void);
uint8_t sendsmstest(uint8_t * pDdataIn,bool ack_test);
const char ATE0[]          = { "\r\nATE0\r\n" } ;           // A    stops echo from modem 
const char ATE0_RESP[]     = { "\r\nATE0\r\nOK\r\n" } ;     //    stops echo from modem 
const char SIM_READY[]     = { "\r\nAT+CPIN?\r\n"};   // B
const char SIM_RESP[]         = { "READY"};
const char CGREG[]        = { "\r\nAT+CGREG?\r\n" }; // C
const char CGREG_RESP[]   = { "\r\n+CGREG: 0,1\r\n"}; // 
const char CMGR[] = {"\r\nAT+CMGR=1\r\n"};

//AT+QSMSL
//const char QSMSL[] = {"\r\nAT+QSMSL\r\n"};
const char CMGL[]    = {"\r\nAT+CMGL=REC UNREAD\r\n"};
const char CMGD[]   = {"\r\nAT+CMGD=1,4\r\n"};  // delete all messages after read
//const char TRANSPARENT_MODE[]   = {  "\r\nAT+QISWTMD=2\r\n"}; // switch to transparent mode 
const char CGDCONT[]     = { "AT+CGDCONT=1,IP,internet,32.154.79.218,0,0,0,0,0,0\r\n"}; // D XILIN SERVER 218.78.213.232 4059
const char CGDCONT_HEADER[]     = { "AT+CGDCONT=1,IP,"};
const char CGDCONT_FOOTER[]     = { ",0,0,0,0,0,0\r\n"};
//const char CGDCONT[]     = { "AT+CGDCONT=1,IP,publicip.net,31.154.79.218,0,0,0,0,0,0\r\n"}; // D XILIN SERVER 218.78.213.232 4059
//const char CGDCONT[]     = { "AT+CGDCONT=1,IP,internet,31.154.8.246,0,0,0,0,0,0\r\n"}; // D XILIN SERVER 218.78.213.232 4059
//const char CGDCONT_RESP[]  = { "OK\r\n"};
//const char QIOPEN []     = { "AT+QIOPEN=1,0,TCP,2.55.107.55,4058,0,2\r\n"}; // Open in transparent mode
//const char QIOPEN []     = { "AT+QIOPEN=1,0,TCP,31.154.8.246,2334,0,2\r\n"}; // Open in transparent mode
//const char QIOPEN []     =    { "AT+QIOPEN=1,0,TCP,32.154.79.218,2334,0,2\r\n"}; // Open in transparent mode
const char QIOPEN_HEADER [] = { "AT+QIOPEN=1,0,TCP,"}; // Open in transparent mode
const char QIOPEN_FOOTER [] = { ",0,2\r\n"}; 
//const char QIOPEN []     = { "AT+QIOPEN=1,0,TCP,31.154.79.218,3556,0,2\r\n"}; // dani's private port
const char QIOPEN_RESP[] = { "\r\nCONNECT\r\n"}; // TO BE CHECK 
const char QICLOSE[]     = { "\r\nAT+QICLOSE=1\r\n"};
const char OK[]          = { "\r\nOK\r\n"};  // to be checked again
//const char CGDCONT_RESP[]= { "\r\n+CGDCONT: 1,IP,internet,2.55.107.55,0,0,0,0,0,0\r\n"};
const char CGDCONT_RESP[]= { "\r\n+CGDCONT: 1,IP,internet,32.154.8.246,0,0,0,0,0,0\r\n"};
const char QISTAT[]      = { "\r\nAT+QISTAT?\r\n" };
const char CSQ[]         = { "\r\nAT+CSQ\r\n"  };
const char COMMAND_MODE[]  = {0x2b,0x2b,0x2b}; // +++ command mode 
const char QIACT_SET[]         = {"\r\nAT+QIACT=1\r\n"};
const char DQIACT_SET[]         = {"\r\nAT+QIDEACT=1\r\n"};
const char QIACT_REQ[]         = {"\r\nAT+QIACT?\r\n"};
const char NOCARRIERRESP[]     = {"\r\nNO CARRIER\r\n"};
const char ERRORRESP[]     =     {"\r\nERROR\r\n"};
const char CONNECTION_DLMS_HEADER_COMMAND[]  =     {0x4D,0x4F,0x44,0x45,0x4D,0x5F,0x49,0x44,0x3D,0x51};
const char CONNECTION_DLMS_FOOTER_COMMAND[]  =     {0x2c,0x4D,0x45,0x54,0x45,0x52,0x5f,0x49,0x44,0x3d,0x51};
//const char SERVER_DLMS_HEARTBIT[] =              { 0x7e, 0xA0, 7, 0x41, 3, 0x53, 0x56, 0xa2, 0x7e  }; y.f. 1/5/2022 change danni is send echo message  
const char SERVER_DLMS_HEARTBIT[] =               {  0x7E, 0xA0, 7, 0x41, 3, 0x1F, 0x26, 0xEC, 0x7E  };
const char SERVER_DLMS_ACK_COMMAND[] =            { 0x7E, 0xA0, 7, 0x41, 3, 0x1F, 0x26, 0xEC, 0x7E  };
const char PHON_HEADER[] = {"+CMT:"};
const char QIACT_CHECK_RESP[]         = {"\r\n+QIACT: 1,1,1"};

#ifdef LONGI_GW
const char CONNECTION_HEADER_COMMAND[]     =    {0x0,0x1,0x0,0x1,0x0,0x1,0x0,0x12,0xa,0x2,0xc};
const char SERVER_LOGIN_HEADER_ACK_COMMAND[]      =    {0,1 ,0 ,1, 0, 1, 0, 0x12, 0xaa, 3 ,0xc}; // this message is ack command received for connection and for login commands
const char SERVER_HEARTBIT_HEADER_ACK_COMMAND[]   =    {0,1 ,0 ,1, 0, 1, 0, 0x11, 0xcc, 3 ,0xc}; // this message is ack command received for connection and for login commands

#else
const char CONNECTION_HEADER_COMMAND[]   = {0x23,0x52,0x23}; // this message is the first message after connect 
const char CONNECTION_FOOTER_COMMAND[]   = {0x2C,0x1}; // this message is the first message after connect 
const char HEARTBIT_COMMAND[]     = {0x23,0x24,0x23,0x15}; // this message is the periodic messag to keep socket alive.
const char SERVER_ACK_COMMAND[]   = {0x23,0x24,0x23}; // this message is ack command received for connection and for heartbit commands
#endif

//const char SMS_IN_HEADER[]   = {"+CMGR:"};
const char SMS_IN_HEADER[]   = {"+GSMS:"};
//const char SMS_IN_HEADER[]   = {"UNREAD"};
//const char SMS_IN_HEADER[]   = {"+CMT: "}; // 15/09
const char DATA_MODE[]     = { "\r\nATO\r\n"};
// const char MODEM_POWER_DOWN = { "AT+QPOWD\r\n"}; not to use use cfun=1,1 for reset 
const char DISCONNECT_CALL[]    = { "ATH/r/n"};
const char MODEM_RESET[]        = {"\r\nAT+CFUN=1,1\r\n"};        // y.f  7/3/21
const char SMS_FORMAT[]         = {"\r\nAT+CMGF=1\r\n"};          // y.f. 7/3/21 TEXT MODE
const char SMS_CHARSET[]        = {"\r\nAT+CSCS=GSM\r\n"};       // y.f. 7/3/21
const char SMS_DELIVERY_FORMAT[]=   {"\r\nAT+CNMI= 2,1,0,0,0\r\n"};  // y.f. 7/3/21
const char ATD[]               = {"\r\nAT&D1\r\n"};  // on to off in DTR turns to command mode  
const char SMS_TEST_SEND1[] =      {"\r\nAT+CMGS=+972546262816\r\n"};
const char yossiphon[] = {"+972546262816"};
//const char yossiphon[] =   {"+972522671485"};
const char SMS_TEST_SEND_HEADER[] = {"\r\nAT+CMGS="};
const char SMS_TEST_SEND_FOOTER[] = {"\r"};
const char CONTROL_Z = 0x1a;
const char SMS_RING_INDICATOR[] = {"\r\nAT+QCFG=urc/ri/smsincoming,pulse\r\n"};;

void Gsm_Init(void);
void Gsm_Handler(uint8_t * pDdataIn, uint32_t Len , EventType Event);
void SetSMSconfig(uint8_t smsstate);
void StartOpenConnection(void);
void StopConnection(void);
void SendData(uint8_t * DataIn, uint16_t Len);
// y.f. 7/2/22 no heart bit in water pulser void SendHeartBit(void);
void SendQIOPEN2Modem(void);
bool CheckProvider(void);
//void SendCONNECT2Modem(void);
void SendACK2Modem(void);
void SendQICLOSE2Modem(void);
void SendCOMMAND_MODE2Modem(void);
void SendDLMSACK2Modem(void);
void SendCGREG2Modem(void);
void SendATE02Modem(void);
void SendQIOPEN2Modem(void);
void SendQIACT_SET2Modem(void);
void SendQIACT_REQ2Modem(void);
extern void SendData2Modem(uint8_t * DataIn, uint16_t Len);
void    modem_SW_reset(void);
void SendConfig2Modem(void);
//void sendsmstest(uint8_t *pInData,bool ack_test);
void Senddatamode(void); // 9/3/2021
void SendSimReady2Modem(void);
bool CheckSimReadyResp(uint8_t* pDdataIn, uint16_t Len);
bool CheckATE0Resp(uint8_t* pDdataIn,uint16_t Len);
bool CheckCGDCONT_Resp(uint8_t* pDdataIn,uint16_t Len);
bool CheckCGREGResp(uint8_t* pDdataIn,uint16_t Len);
bool CheckQIOPENResp(uint8_t* pDdataIn,uint16_t Len);
bool CheckQIOPENResp(uint8_t* pDdataIn,uint16_t Len);
bool CheckQIACT_REQResp(uint8_t* pDdataIn,uint16_t Len);
bool CheckQIACT_SETResp(uint8_t* pDdataIn,uint16_t Len);
bool CheckACKResp(uint8_t*pDdataIn,uint16_t Len);
bool CheckSMSResp(uint8_t*pDdataIn,uint16_t Len);

bool CheckNOCARRIERResp(uint8_t* pDdataIn, uint16_t Len);
bool CheckErrorResp(uint8_t* pDdataIn,uint16_t Len);
bool sms_config_received =false;
uint8_t ConnectionState   = MODEM_DISCONNECT_STATE;   //
static uint8_t AT_bufferTransmit[256];
//static uint8_t SMS_ON = 0;  // y.f. 9/3/2021 add a break to transparent mode to read sms
static uint8_t sms_config =0;
//extern void DelayYos(uint32_t Timems);
extern RepeaterConfigStruct RepeaterConfig;
extern uint16_t ReadConfigFromSMS(uint8_t*pDdataIn, uint16_t Len);
//extern void SetLed(ioport_port_pin_t pin_num, bool STATE);
extern void  ToggleLed1(void);
#ifdef DEBUG_ON
extern void SendData2Debug(uint8_t * DataIn, uint16_t Len,DebugOriginating debug);
#endif
uint8_t GsmCompleateStatus(void)
{
    return ConnectRetries;
}
void ClrGsmCompleate(void)
{
  ConnectRetries =4;
}
void SetGsmCompleate(void)
{
  ConnectRetries=0;
  GsmTimer=0;
  ConnectionState=MODEM_DISCONNECT_STATE;
  ToggleLedsReq = false;

