yossif58/GW_WP_RAM4M3/gw_ra4m3/src/gsm.c
}
void Gsm_Init(void)
{
  ConnectionState=MODEM_DISCONNECT_STATE;
  SendRetry = SEND_RETRY_TIMES;  
  GsmTimer = 200; // wait 2 seconds and then check if provider is connected
  ToggleLedsReq = false;
  // Start gsmtimer to check if already connect to provider 
}
void Gsm_Handler(uint8_t * pDdataIn, uint32_t Len , EventType Event)
{
    char *   position;
    char Str[100];


    position= strstr((char*)pDdataIn,(char *)SMS_IN_HEADER);
    if (position)
    {// sms can come in evry state
        sms_config_received =true;
#ifdef DEBUG_UART_MODE9
  //      sprintf (( char*)&Str, "RECEIVED  SMS FROM USER\r\n" );
  //      position[70]=0;
  //      strcat (( char*)&Str,( char*)position);
        //     R_SCI_UART_Write (&Debug_Uart1_ctrl, Str,80);
              R_SCI_UART_Write (&Debug_Uart1_ctrl, "debugGW RECEIVED  SMS FROM USER\r\n" ,37);
              R_BSP_SoftwareDelay (500, 1000); // delay 2 sec
#endif
        DelSmsMsg();
      uint16_t resultsms;
      resultsms = ReadConfigFromSMS(position, Len);
      if (resultsms ==1)
      {// enter to flash only if valid configuration is found
        WriteInternalFlashConfig(); // 3/1/2023 store the configuration
        R_BSP_SoftwareDelay (500, 1000); // delay 2 sec
        memcpy ((unsigned char*) &RepeaterConfig, (uint8_t*) FLASH_HP_DF_BLOCK_1, sizeof(RepeaterConfigStruct)); // 4/1/23 readback to be sure it was changed
        //write_internal_config_flag = true; // 14/6/22 temp use flag instead of direct write internal
        sendsmstest(pDdataIn,true); //18/12/22 send ack configuration to user
       /* Issue a software reset to reset the MCU. */
        if (ConnectionState == MODEM_MAGNET_READ_SMS) SendRetry =1; // y.f. 18/12/22 stop wait for sms go to nest state
        // HAL_NVIC_SystemReset(); // after configuration read from sms reset mcu is needed
      }
      else if (resultsms ==2)
      {
          sendsmstest(pDdataIn,true); //18/12/22 send ack configuration to user
      }
      else
      {
#ifdef DEBUG_UART_MODE3
        R_SCI_UART_Write (&Debug_Uart1_ctrl, "debugGW not valid sms\r\n",22);
#endif
      }
    }
    else
    {
        if (strstr((char*)pDdataIn,"+CMGR"))
        { // other sms should be simple delete
          DelSmsMsg();
        }
    }

  switch(ConnectionState)
  {
    case MODEM_DISCONNECT_STATE:
        if (Event == TIME_OUT_EVENT)
        {
          if ( ConnectRetries)
          {
              ConnectRetries--;
              SendCOMMAND_MODE2Modem();
              ConnectionState = MODEM_AT0_STATE;
              GsmTimer = 200;
              SendRetry = SEND_RETRY_TIMES;
          }
       }
      
      break;
  case MODEM_AT0_STATE:
        if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
            {
              modem_SW_reset(); // need to reset modem it does not response 
            }
            else SendATE02Modem();
        }
        else if  (Event==DATA_IN_EVENT)
        {
          if (CheckATE0Resp(pDdataIn, Len))
          {
            SendRetry = SEND_RETRY_TIMES;
            ConnectionState = MODEM_SET_CONFIGURATION_STATE;
            SendConfig2Modem();
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state SET CONFIG\r\n" ,38);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif
          }
          else
          {
              sms_config = 0; // for test to removed
          }
        }
    break;
  case MODEM_SET_CONFIGURATION_STATE:
    
        if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
            {
              modem_SW_reset(); // need to reset modem it does not response 
            }
            else SendConfig2Modem();
        }
        else if  (Event==DATA_IN_EVENT)
        {
          if (CheckCGDCONT_Resp(pDdataIn, Len))
          {
            SendRetry = SEND_RETRY_TIMES;
            ConnectionState = MODEM_SET_SMS_CONFIGURATION_STATE;
            sms_config = 0;
            SetSMSconfig(sms_config);
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state SET SMS CONFIG\r\n" ,41);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif

          }
        }
    break;

    case MODEM_SET_SMS_CONFIGURATION_STATE:
        if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
             {
               modem_SW_reset(); // need to reset modem it does not response
             }
            else
            {
                sms_config =0;
                SetSMSconfig(sms_config);
            }
            GsmTimer = 200;
        }
        else
          if  (Event==DATA_IN_EVENT)
          {
            position = strstr(pDdataIn,(char*)OK);
            if (position)
            {
              if (sms_config < 5)
              {
                SetSMSconfig(sms_config);
                sms_config++;
                if ( sms_config==5)
                {
                  SendRetry = SEND_RETRY_TIMES;
                  ConnectionState = SIM_READY_STATE;
                  SendSimReady2Modem();
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state sim ready\r\n" ,34);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif

                }
              }
            }
          }
 

    break;
    case SIM_READY_STATE:
    if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
            {
              modem_SW_reset(); // need to reset modem it does not response 
            }
            else SendSimReady2Modem();
        }
    else
       if  (Event==DATA_IN_EVENT)
        {
          if (CheckSimReadyResp(pDdataIn, Len))
          {
       
            SendRetry = SEND_RETRY_TIMES;
            ConnectionState = MODEM_PROVIDER_STATE;
            SendCGREG2Modem();
//            HAL_UART_Transmit(&UartDEBUGHandle,"\r\Sim Ready",11,5000 != HAL_OK);
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state MODEM PROVIDER\r\n" ,40);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif
          }
        }     
    
    break;

