yossif58/GW_WP_RAM4M3/gw_ra4m3/src/gsm.c
    case MODEM_PROVIDER_STATE:
        if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
            {
              modem_SW_reset(); // need to reset modem it does not response 
            }
            else SendCGREG2Modem();
        }
        else if  (Event==DATA_IN_EVENT)
        {
        
          if (CheckCGREGResp(pDdataIn, Len))
          {
    //           sendsmstest("yossi test",false ); // to be removed for test only
  //            R_BSP_SoftwareDelay (100, 1000); // delay 1 sec temp to be removed
      //        if (powerup_start)
              {
               //   MagnetDetect  = false;
         //         powerup_start = false;
                  GsmTimer = 100; // 2 min wait befor going to to be removed
                  ConnectionState = MODEM_MAGNET_READ_SMS;
#ifdef DEBUG_UART_MODE3
                 R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state MODEM_MAGNET_READ_SMS\r\n" ,51);
#endif
       //         sendsmstest("wait for new config",false);  //to be removed
      //            ReadSmsMsg();
                  SendRetry = 4; // y.f. send read sms befor close socket
          //        sendfreesms("START SCAN FOR SMS CONFIG");

              }
#if 0
              else
              {
//                sendsmstest(pDdataIn,false); // for test only to be removd
                SendRetry = SEND_RETRY_TIMES;
 //               sendsmstest("yossi test",false ); // to be removed for test only
 //               R_BSP_SoftwareDelay (100, 1000); // delay 1 sec temp to be removed
   //             GsmTimer = 1200; // 2 min wait befor going to to be removed
                ConnectionState = MODEM_ACTIVATE_CONTEXID_STATE;
                SendQIACT_REQ2Modem();
#ifdef DEBUG_UART_MODE4
                R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state MODEM ACTIVATE CONTEXT ID\r\n" ,51);

#endif
              }
#endif
          }

          
        }
    
    break;
    case  MODEM_MAGNET_READ_SMS:
        if (Event == TIME_OUT_EVENT)
         {
             if ((--SendRetry)==0)
             {
                 // no sms continue to connect

                 SendRetry = SEND_RETRY_TIMES;
                 GsmTimer = 1200; // 2 min wait befor going to to be removed
                 ConnectionState = MODEM_ACTIVATE_CONTEXID_STATE;
                 SendQIACT_REQ2Modem();
#ifdef DEBUG_UART_MODE4
                 R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state MODEM ACTIVATE CONTEXT ID\r\n" ,51);
 #endif
             }
             else
             {
              //   GsmTimer = 10000; // 2 min wait befor going to to be removed
                 ReadSmsMsg();
                 GsmTimer = 1000; // 2 min wait befor going to to be removed
             }
         }
        else if (sms_config_received)
        {
            sms_config_received =false;
            SendRetry = SEND_RETRY_TIMES;
            GsmTimer = 300; // 2 min wait befor going to to be removed
            ConnectionState = MODEM_ACTIVATE_CONTEXID_STATE;
            SendQIACT_REQ2Modem();
        }
        break;
  case MODEM_ACTIVATE_CONTEXID_STATE:
           if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
            {
              modem_SW_reset(); // need to reset modem it does not response 
            }
            else SendQIACT_REQ2Modem();
        }
        else if  (Event==DATA_IN_EVENT)
        {
          
          if (CheckQIACT_REQResp(pDdataIn, Len))
          {// Contex id already exist go to connection state 
            SendRetry = SEND_RETRY_TIMES;
            ConnectionState = MODEM_QIOPEN_STATE;
            SendQIOPEN2Modem();
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state MODEM QIOPEN\r\n" ,38);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif

          }
          else
          { // need to activate contexid
              //     SendRetry = SEND_RETRY_TIMES*10;
            SendRetry = SEND_RETRY_TIMES;
            ConnectionState = MODEM_ACTIVATE_SET_CONTEXID_STATE;
            SendQIACT_SET2Modem();
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state MODEM ACTIVATE CONTEXT ID SET\r\n" ,55);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif
            
          }
        }
    break;
     case MODEM_ACTIVATE_SET_CONTEXID_STATE:
           if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
            {
              modem_SW_reset(); // need to reset modem it does not response 
            }
            else SendQIACT_SET2Modem();
        }
        else if  (Event==DATA_IN_EVENT)
        {
          
          if (CheckQIACT_SETResp(pDdataIn, Len))
          {
            SendRetry = SEND_RETRY_TIMES;
            ConnectionState = MODEM_QIOPEN_STATE;
            SendQIOPEN2Modem();
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state MODE QIOPEN\r\n" ,35);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif
//            HAL_UART_Transmit(&UartDEBUGHandle,"\r\Contexid Activated",20,5000 != HAL_OK);

          }
        }
    break;
 
  case MODEM_QIOPEN_STATE:
         if (Event == TIME_OUT_EVENT)
        {
            if ((--SendRetry)==0)
            {
             SendQICLOSE2Modem();
             R_BSP_SoftwareDelay (1000, 1000); // delay 2 sec
             //DelayYos(1000000);
             modem_SW_reset(); // need to reset modem it does not response 
            }
            else SendQIOPEN2Modem();
        }
        else if  (Event==DATA_IN_EVENT)
        {
          if (CheckQIOPENResp(pDdataIn, Len))
          {

            ConnectionState = MODEM_CONNECT_STATE;

            // 15/1/23  LOGIN TO server as gw
            SendLogin2Server();
            GsmTimer = 3000;
            SendRetry = SEND_RETRY_TIMES;

