yossif58/GW_WP_RAM4M3/gw_ra4m3/src/gsm.c
#ifdef DEBUG_UART_MODE4
 //           R_BSP_SoftwareDelay(100, 1000); //

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state CONNECT\r\n" ,35);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed

#endif

          }
          else if (CheckErrorResp(pDdataIn, Len))
          { // It seems contexid is already used try close and open again
#ifdef DEBUG_UART_MODE4

            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW DACIVATE AGAIN\r\n" ,25);

#endif

       // temp removed just wait for time out and send qiopen again
       // temp removed 15/09/22       ReadSmsMsg();
             GsmTimer = 510;
             SendRetry = 1; // y.f. send read sms befor close socket 
          }
        }
    break;
    case MODEM_CONNECT_STATE: // state only for dlt 
         if (Event == TIME_OUT_EVENT)
        {
          
            if ((--SendRetry)==0)
            {
              modem_SW_reset(); // need to reset modem it does not response 
            }
            else
            {  // y.f. 7/2/2022 SendCONNECT2Modem();
                // 15/1/23  LOGIN TO server as gw
                SendLogin2Server();
                GsmTimer = 510;
            }
        }
        else if  (Event==DATA_IN_EVENT)
        {

            if (ExtractWrapper(pDdataIn,Len) == LOGIN_RESPONSE)
            { // server ack to connection message from meter
                SendRetry = SEND_RETRY_TIMES;
                ConnectionState = MODEM_DATA_STATE;
                heartbit_count =0;
                SendHeartBit2Server();
                GsmTimer = 12000;
                ToggleLedsReq = true;
                SetLed (PULSER_LED1, true); // to be removed only for test
                SetLed (PULSER_LED2, true);

#ifdef DEBUG_UART_MODE4
            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW connection state DATA\r\n" ,30);
#endif

          }
          else if(CheckNOCARRIERResp(pDdataIn, Len))
          {
             ToggleLedsReq = false;
                          // end of communication 
             modem_SW_reset(); // need to reset modem server does not response 
          }   
          else
          {
#ifdef DEBUG_UART_MODE4
            R_SCI_UART_Write(&Debug_Uart1_ctrl,"debugGW not proper message rx\r\n" ,40);
#endif

          }

        }
    break;
    
    
    case MODEM_DATA_STATE:
        if (Event == TIME_OUT_EVENT) 
        {
           if ( heartbit_count < 10)
           {
               SendHeartBit2Server();
               GsmTimer = 12000; // 2 min heart bit
               heartbit_count++;
           }
           else
           { // it seems that server is not responding try reconnect
               modem_SW_reset(); // need to reset modem it does not response
           }
        }
        else if  (Event==DATA_IN_EVENT)
        {
          if (CheckNOCARRIERResp(pDdataIn, Len))
          {
                            // end of communication 
                  modem_SW_reset(); // need to reset modem no carrier
          }
          else
          switch(ExtractWrapper(pDdataIn,Len))
          {
              case HEARTBIT_RESPONSE:
                  heartbit_count = 0 ;
                  break;
              case DLMS_MSG_2_METER:
                  // send transparent to coordinator
                  R_SCI_UART_Write (&Debug_Uart1_ctrl, pDdataIn, Len);
                  break;
              case DLMS_MSG_2_GW:
                  // t b d y.f. 8/3/23
                  break;
              default: // ignore not proper or other
                  break;
          }
         }
      break;
  }
 
}

void SendSimReady2Modem(void)
{
 
  memcpy (AT_bufferTransmit,SIM_READY,sizeof(SIM_READY));
  SendData2Modem(AT_bufferTransmit,sizeof(SIM_READY));



   GsmTimer = 200;
}

bool CheckSimReadyResp(uint8_t* pDdataIn, uint16_t Len)
{
     if (strstr((char*)pDdataIn,(char*)SIM_RESP))
       return true;
     return false;
}
void SendACK2Modem(void)
{
  memcpy (AT_bufferTransmit,SERVER_ACK_COMMAND,sizeof(SERVER_ACK_COMMAND));
  SendData2Modem(AT_bufferTransmit,sizeof(SERVER_ACK_COMMAND));
 // GsmTimer = 2400; // 2 min wait befor sending heartbit
}


bool CheckSMSResp(uint8_t*pDdataIn,uint16_t Len)
{
  if (strstr((char*)pDdataIn,(char*)SMS_IN_HEADER))
 
      return true;
  else
      return false;
   
}

bool CheckNOCARRIERResp(uint8_t* pDdataIn, uint16_t Len)
{
     if (strstr((char*)pDdataIn,(char*)NOCARRIERRESP))
       return true;
     return false;
}
bool CheckErrorResp(uint8_t* pDdataIn,uint16_t Len)
{
   if (strstr((char*)pDdataIn,(char*)ERRORRESP))
       return true;
     return false; 
}

                    
bool CheckCGDCONT_Resp(uint8_t* pDdataIn,uint16_t Len)
{
    if (strstr((char*)pDdataIn,(char*)OK))

       return true;
     return false;

  
}

bool CheckATE0Resp(uint8_t* pDdataIn,uint16_t Len)
{
 
 if  (strstr((char*)pDdataIn,(char*)OK))
 
  
  return true;
 else
  return false;
  
}
bool CheckCGREGResp(uint8_t* pDdataIn,uint16_t Len)
{
 // if (memcmp(pDdataIn,(uint8_t*)CGREG_RESP, sizeof(CGREG_RESP)-1))
  if (strstr((char*)pDdataIn,(char *)CGREG_RESP))
  return true;
 else
  return false;

}


bool CheckQIOPENResp(uint8_t* pDdataIn,uint16_t Len)
{
  if (strstr((char*)pDdataIn,(char*)QIOPEN_RESP))
  {//good response go to next state
 
    return true;
  } 
  return false;
}

void StartOpenConnection(void)
{
 // SendAtCommand(AT_open);
}

void StopConnection(void)
{
 // SendAtCommand(AT_close);
}

void SendCOMMAND_MODE2Modem(void)
{
//  HAL_GPIO_WritePin(MODEM_DTR_PORT, MODEM_DTR_PIN,GPIO_PIN_RESET);  // DTR ON TO OFF=COMMAND MODE
//#if 0
 // temp removed y.f. 15/6/2022  DelayYos(7000000);
  memcpy (AT_bufferTransmit,COMMAND_MODE,sizeof(COMMAND_MODE));
  SendData2Modem(AT_bufferTransmit,sizeof(COMMAND_MODE)); // return to data mode 
  R_BSP_SoftwareDelay (2000, 1000); // delay 2 sec



//  DelayYos(7000000);
//#endif
  

}
#if 0
// not in use in pulser
void SMS_Handler(void)
{

   switch  (SMS_ON)
   {
      case 0:
//        HAL_UART_Transmit(&UartDEBUGHandle,"\r\n\modem enter to command mode\r\n",31,5000 != HAL_OK);
        GsmTimer = 120; // at least 1 sec befor +++
        SMS_ON++;
        break;
      case 1:
        SendCOMMAND_MODE2Modem(); // turn off transparent mode and go back to command mode for sms read
        GsmTimer = 340; // 4000; //340;
        SendRetry = SEND_RETRY_TIMES;
        SMS_ON++;
        break;
      case 2:
        ReadSmsMsg();
        GsmTimer = 510; //4000;//510;
        SMS_ON++;
        break;
      case 3:
          SendATE02Modem(); // 5/1/2022 y.f. avoid echo 
          SMS_ON++;
          GsmTimer = 1100; //4000;//510;
          break;
      case 4:    
        Senddatamode();
        GsmTimer = 1085; // 2 min wait befor sending heartbit
        SMS_ON = 0;
        SendRetry = SEND_RETRY_TIMES;
//        HAL_UART_Transmit(&UartDEBUGHandle,"\r\nmodem back to data mode\r\n",27,5000 != HAL_OK);
        break;
   }
 
   
   
