yossif58/GW_WP_RAM4M3/gw_ra4m3/src/gsm.c
}
#endif

void SendDLMSACK2Modem(void)
{
  memcpy (AT_bufferTransmit,SERVER_DLMS_ACK_COMMAND,sizeof(SERVER_DLMS_ACK_COMMAND));
  SendData2Modem(AT_bufferTransmit,sizeof(SERVER_DLMS_ACK_COMMAND));
 // GsmTimer = 1200; // 2 min wait befor going to
}


void SendQIOPEN2Modem(void)
{
  
  AT_bufferTransmit[0]=0;
  strcat((char*)&AT_bufferTransmit , QIOPEN_HEADER);
  strcat((char*)&AT_bufferTransmit , RepeaterConfig.GsmConfig.ServerIP);
  strcat((char*)&AT_bufferTransmit,(char*)",");
  strcat((char*)&AT_bufferTransmit , RepeaterConfig.GsmConfig.Port);
  strcat((char*)&AT_bufferTransmit , QIOPEN_FOOTER);
  SendData2Modem(AT_bufferTransmit,strlen(AT_bufferTransmit));
  GsmTimer = 300; // wait 2 seconds and then check if provider is conn
  
  
//  memcpy (AT_bufferTransmit,QIOPEN,sizeof(QIOPEN));
//  SendData2Modem(AT_bufferTransmit,sizeof(QIOPEN)-1);
//  GsmTimer = 3000; // wait 30 seconds
 
}
void SendQICLOSE2Modem(void)
{
//  HAL_UART_Transmit(&UartDEBUGHandle,"\r\close socket",14,5000 != HAL_OK);

  memcpy (AT_bufferTransmit,QICLOSE,sizeof(QICLOSE));
  SendData2Modem(AT_bufferTransmit,sizeof(QICLOSE)-1);
  GsmTimer = 200; // wait 30 seconds
 
}

void SendConfig2Modem(void)
{
  AT_bufferTransmit[0]=0;
  strcat((char*)&AT_bufferTransmit , CGDCONT_HEADER);
  strcat((char*)&AT_bufferTransmit , RepeaterConfig.GsmConfig.APN);
  strcat((char*)&AT_bufferTransmit,(char*)",");
  strcat((char*)&AT_bufferTransmit , RepeaterConfig.GsmConfig.ServerIP);
  strcat((char*)&AT_bufferTransmit , CGDCONT_FOOTER);
  SendData2Modem(AT_bufferTransmit,strlen(AT_bufferTransmit));
  GsmTimer = 200; // wait 2 seconds and then check if provider is connected
}
void SendATE02Modem(void)
{
  memcpy (AT_bufferTransmit,ATE0,sizeof(ATE0));
  SendData2Modem(AT_bufferTransmit,sizeof(ATE0)-1);
  GsmTimer = 200; // wait 2 seconds and then check if provider is connected
}
void SendCGREG2Modem(void)
{
  memcpy (AT_bufferTransmit,CGREG,sizeof(CGREG));
  SendData2Modem(AT_bufferTransmit,sizeof(CGREG)-1);
  GsmTimer = 300; // wait 2 seconds and then check if provider is connected
}
void SendQIACT_REQ2Modem(void)
{
  memcpy (AT_bufferTransmit,QIACT_REQ,sizeof(QIACT_REQ));
  SendData2Modem(AT_bufferTransmit,sizeof(QIACT_REQ)-1);
  GsmTimer = 300; // wait 2 seconds and then check if provider is connected
}
void SendQIACT_SET2Modem(void)
{
  memcpy (AT_bufferTransmit,QIACT_SET,sizeof(QIACT_SET));
  SendData2Modem(AT_bufferTransmit,sizeof(QIACT_SET)-1);
  GsmTimer = 200; // wait 2 seconds and then check if provider is connected
}
void SendDQIACT_SET2Modem(void)
{
  memcpy (AT_bufferTransmit,DQIACT_SET,sizeof(DQIACT_SET));
  SendData2Modem(AT_bufferTransmit,sizeof(DQIACT_SET)-1);
  GsmTimer = 200; // wait 2 seconds and then check if provider is connected
}


void ReadSmsMsg(void)
{
#if 0
  memcpy (AT_bufferTransmit,CMGR,sizeof(CMGR));
  SendData2Modem(AT_bufferTransmit,sizeof(CMGR)-1);
#endif

  memcpy (AT_bufferTransmit,CMGL,sizeof(CMGL));
  SendData2Modem(AT_bufferTransmit,sizeof(CMGL)-1);


 // y.f. removed 14/09/22 GsmTimer = 200; // wait 2 seconds
}

void DelSmsMsg(void)
{
  memcpy (AT_bufferTransmit,CMGD,sizeof(CMGD));
  SendData2Modem(AT_bufferTransmit,sizeof(CMGD)-1);
 // y.f. 13/9/ temp removed  GsmTimer = 200; // wait 2 seconds
}
void SendATD(void)
{
  memcpy (AT_bufferTransmit,ATD,sizeof(ATD));
  SendData2Modem(AT_bufferTransmit,sizeof(ATD)-1);
 // removed 14/09/22  GsmTimer = 200; // wait 2 seconds
}
void Senddatamode(void)
{
  //HAL_GPIO_WritePin(MODEM_DTR_PORT, MODEM_DTR_PIN,GPIO_PIN_SET);  // DTR OFF TO ON = DATA MODE


  memcpy (AT_bufferTransmit,DATA_MODE,sizeof(DATA_MODE));
  SendData2Modem(AT_bufferTransmit,sizeof(DATA_MODE)-1);
 // y.f. 14/09/22 removed  GsmTimer = 200; // wait 2 seconds and then check if provider is connected
  
}

bool CheckQIACT_SETResp(uint8_t* pDdataIn,uint16_t Len)
{
   if (strstr((char*)pDdataIn,OK)) 
   return true;
    else
  return false;
}
bool CheckQIACT_REQResp(uint8_t* pDdataIn,uint16_t Len)
{
  if (strstr((char*)pDdataIn,(char*)QIACT_CHECK_RESP)) 
  return true;
    else
  return false;
}


void    modem_SW_reset(void)
{
 // HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);  
  SendCOMMAND_MODE2Modem();   
  memcpy (AT_bufferTransmit,MODEM_RESET,sizeof(MODEM_RESET));
  SendData2Modem(AT_bufferTransmit,sizeof(MODEM_RESET)-1);
  SendRetry = SEND_RETRY_TIMES;
  ConnectionState = MODEM_DISCONNECT_STATE;
//#ifdef DEBUG_UART_MODE
//            R_SCI_UART_Write(&Debug_Uart1_ctrl,"connection state DISCONNECT\r\n" ,29);
//            R_BSP_SoftwareDelay(1000, bsp_delay_units); // delay 1 sec temp to be removed
//
//#endif
  GsmTimer = 200; // wait 2 seconds and then check if provider is connected
//  HAL_UART_Transmit(&UartDEBUGHandle,"\r\Modem Disconnect",18,5000 != HAL_OK);

}  

void SetSMSconfig(uint8_t smsstate)
{
  //SendSMSGPRS();
      switch (smsstate)
      {
      case 0:
          memcpy (AT_bufferTransmit,SMS_FORMAT,sizeof(SMS_FORMAT));
          SendData2Modem(AT_bufferTransmit,sizeof(SMS_FORMAT)-1);
        break;
      case 1:
         memcpy (AT_bufferTransmit,SMS_CHARSET,sizeof(SMS_CHARSET));
        SendData2Modem(AT_bufferTransmit,sizeof(SMS_CHARSET)-1);
        break;
      case 2:
          memcpy (AT_bufferTransmit,SMS_DELIVERY_FORMAT,sizeof(SMS_DELIVERY_FORMAT));
          SendData2Modem(AT_bufferTransmit,sizeof(SMS_DELIVERY_FORMAT)-1);
        break;
      case 3:
        SendATD();
        break;
      case 4:
     //     DelSmsMsg(); // y.f. 14/12/22

     //    memcpy (AT_bufferTransmit,SMS_RING_INDICATOR,sizeof(SMS_RING_INDICATOR));
     //    SendData2Modem(AT_bufferTransmit,sizeof(SMS_RING_INDICATOR)-1);
        break;
        
     }
  GsmTimer = 200;
}
  uint8_t sendsmstest(uint8_t * pDdataIn,bool ack_test)
  {

    // retrieve caller phon number 
    uint16_t bInd=0,tmp=0;
    uint8_t SmsPhon[20];
    AT_bufferTransmit[0]=0;
    strcat((char*)&AT_bufferTransmit , SMS_TEST_SEND_HEADER);
    memset(SmsPhon,0,sizeof(SmsPhon));
    while (((pDdataIn[bInd]!= 0x22)|| (pDdataIn[bInd+1]!= 0x2b)) && (bInd <50)) // find first '"+'
           bInd++;
     bInd++;
   
