yossif58/GW_WP_RAM4M3/gw_ra4m3/src/gsm.c
    if (ack_test)
    {
      if (bInd>=50) return 0;
      while ((pDdataIn[bInd]!= 0x22)&& (bInd <140))  // find second '"' sample "+972546262888"
           SmsPhon[tmp++] = pDdataIn[bInd++];
    
      strcat((char*)&AT_bufferTransmit , (char*)SmsPhon);
    }
    else
    {
      strcat((char*)&AT_bufferTransmit , (char*)yossiphon);
    }
    strcat((char*)&AT_bufferTransmit , SMS_TEST_SEND_FOOTER);
    if (ack_test)
    {// Y.F. 4/1/23 add ip & port
        strcat((char*)&AT_bufferTransmit , "IP:");
        strcat((char*)&AT_bufferTransmit , RepeaterConfig.GsmConfig.ServerIP);
        strcat((char*)&AT_bufferTransmit, "\r\nPORT:");
        strcat((char*)&AT_bufferTransmit , RepeaterConfig.GsmConfig.Port);

    }
    //  strcat (AT_bufferTransmit,"retrofit ack configuration");
    else
      strcat (AT_bufferTransmit,"          Start Modem");
    strcat((char*)&AT_bufferTransmit,(char*)&CONTROL_Z);
    SendData2Modem(AT_bufferTransmit,strlen(AT_bufferTransmit));
    R_BSP_SoftwareDelay (2000, 1000); // delay 20 sec to be sure all message is sent

//    DelayYos(5000000);
    return 1;
 }
  void sendfreesms(uint8_t * pDdataIn)
  {

    // retrieve caller phon number 
    uint8_t SmsPhon[20];
    AT_bufferTransmit[0]=0;
    strcat((char*)&AT_bufferTransmit , SMS_TEST_SEND_HEADER);
    memset(SmsPhon,0,sizeof(SmsPhon));
    strcat((char*)&AT_bufferTransmit , (char*)yossiphon);
    strcat((char*)&AT_bufferTransmit , SMS_TEST_SEND_FOOTER);
//    strcat (AT_bufferTransmit,"retrofit ack configuration");
    strcat (AT_bufferTransmit,pDdataIn);
    strcat((char*)&AT_bufferTransmit,(char*)&CONTROL_Z);
    SendData2Modem(AT_bufferTransmit,strlen(AT_bufferTransmit));
//    DelayYos(5000000);
    R_BSP_SoftwareDelay (2000, 1000); // delay 2 sec

 }

void RingHandler(void)
{
   if (ConnectionState>=MODEM_PROVIDER_STATE)
       //  HAL_NVIC_SystemReset(); // after configuration read from sms reset mcu is needed
           __NVIC_SystemReset;
}

void  Error_UartGSMHandler(void)
{
  while (1)
  {
  }
}

uint16_t  ReadConfigFromSMS(uint8_t *pDdataIn, uint16_t Len)
{
    char *position;
    uint16_t bInd=0;
    RepeaterConfigStruct tmpRepeaterConfig;
    position = (strstr((char*)pDdataIn,",2,"));
    if (position==0)
    {
        position = (strstr((char*)pDdataIn,",3,"));
        if (position ==0 ) return 0;  // not found start of string
        else  return 2 ; // this is read config just send config
    }
    position = position+3;
    // extract server ip Ex 31.22.22.154
    memcpy ((uint8_t*)& tmpRepeaterConfig,(uint8_t*)&RepeaterConfig,sizeof (RepeaterConfigStruct));
    memset ((uint8_t*)& tmpRepeaterConfig.GsmConfig,0,sizeof (GSMConfigStruct));// y.f. 3/1/23
    for (bInd = 0 ;bInd < 17 ; bInd++)
    {
        if ((char)(*position) ==',')
            break;
        if (((char)(*position) =='.') ||
           ((*position <= 0x39) && (*position >=0x30)))
            tmpRepeaterConfig.GsmConfig.ServerIP[bInd]=*position++;
        else
        {
            if ((*position==0xa) || (*position==0xd))
            {
                position++;
            }
            else
            {// 14/12/22 ignore cr line feed
                PrintSMSError(position);
                return 0; // not valid char
            }
        }
   }

   // RepeaterConfig.GsmConfig.ServerIP  [bInd]=0;
   position++;

   for (bInd = 0 ;bInd < 6 ; bInd++)
   {
        if ((char)(*position) ==',')
            break;
        if   ((*position <= 0x39) && (*position >=0x30))
            tmpRepeaterConfig.GsmConfig.Port[bInd]=*position++;
        else
        if ((*position==0xa) || (*position==0xd))
        {
            position++;
        }
        else
        {// 14/12/22 ignore cr line feed
            PrintSMSError(position);
            return 0; // not valid char
        }
   }

 //  tmpRepeaterConfig.GsmConfig.Port[bInd]=0;
     position++;
   for (bInd = 0 ;bInd < 20 ; bInd++) // max apn chars
   {
     if (*position ==',')
     {
         tmpRepeaterConfig.GsmConfig.APN[bInd] = 0;
         memcpy((uint8_t*)&RepeaterConfig,(uint8_t*)&tmpRepeaterConfig,sizeof(RepeaterConfigStruct)); //4/1/23 only if everything is OK change RepeaterConfig
        return 1;
     }
     tmpRepeaterConfig.GsmConfig.APN[bInd] = *position++;
   }
   PrintSMSError(position);
   return 0; // not valid char

}

#ifdef DEBUG_UART_MODE3
void PrintSMSError (char *data)
{
        char Str[50];

        sprintf (( char*)&Str, "This is The place We failed:" );
        data[70]=0;
        strcat (( char*)&Str,( char*)data);
        R_SCI_UART_Write (&Debug_Uart1_ctrl, Str,80);
        R_BSP_SoftwareDelay (500, 1000); // delay 2 sec
}
#endif
